# Homework

## Problem 4

### Import the libraries

#### Import արեք pandas գրադարանը pd  անունով

In [1]:
import pandas as pd

### Import the dataset baby_names.txt, assign it to a variable called baby_names

### Import արեք baby_names.txt dataset-ը ու այն վերագրեք baby_names փոփոխականի

In [3]:
baby_names = pd.read_csv('pandas_practical/data/baby_names.csv')

### See the first 10 entries.

### Տպեք առաջին 10 արժեքը

In [4]:
baby_names.head(10)

   Unnamed: 0     Id      Name  Year Gender State  Count
0       11349  11350      Emma  2004      F    AK     62
1       11350  11351   Madison  2004      F    AK     48
2       11351  11352    Hannah  2004      F    AK     46
3       11352  11353     Grace  2004      F    AK     44
4       11353  11354     Emily  2004      F    AK     41
5       11354  11355   Abigail  2004      F    AK     37
6       11355  11356    Olivia  2004      F    AK     33
7       11356  11357  Isabella  2004      F    AK     30
8       11357  11358    Alyssa  2004      F    AK     29
9       11358  11359    Sophia  2004      F    AK     28

### Delete the columns 'Unnamed: 0' and 'Id'

### Ջնջեք 'Unnamed: 0' ու 'Id' սյուները

In [6]:
baby_names.drop(['Unnamed: 0', 'Id'], axis=1)

         Name  Year Gender State  Count
0        Emma  2004      F    AK     62
1     Madison  2004      F    AK     48
2      Hannah  2004      F    AK     46
3       Grace  2004      F    AK     44
4       Emily  2004      F    AK     41
...       ...   ...    ...   ...    ...
2498    Devin  2004      M    AK     12
2499     Liam  2004      M    AK     12
2500     Paul  2004      M    AK     12
2501  Richard  2004      M    AK     12
2502  Trenton  2004      M    AK     12

[2503 rows x 5 columns]

### Are there more male or female names in the dataset?

### Արդյոք dataset-ում ավելի շատ են կանացի թե տղամարդու անունները?

In [19]:
baby_names.groupby("Gender").agg({"Gender":"count"})

        Gender
Gender
F         2404
M           99

### Delete the column 'Year'. Group the dataset by name and assign to names.

### Ջնջեք 'Year' սյունը. Խմբավորեք dataset-ը ըստ անունի ու վերագրեք արդյունքը names փոփոխականին

In [49]:
names=baby_names.drop(['Unnamed: 0', 'Id',"Year"],axis=1)\
.groupby("Name").agg({"Gender":"count"})\
.sort_values("Gender",ascending=False)\
.reset_index()
names

          Name  Gender
0        Riley      12
1      Aaliyah      11
2        Emily      11
3    Josephine      11
4         Jade      11
..         ...     ...
570      Keely       1
571      Caleb       1
572      Kevin       1
573      Kiera       1
574    Anthony       1

[575 rows x 2 columns]

### How many different names exist in the dataset?

### Քանի հատ տարբեր անուն կա dataset-ում?

In [35]:
names.count()

Name      575
Gender    575
dtype: int64

### What is the name with most occurrences?

### Որն է ամենաշատ հանդիպող անունը?

In [36]:
names.head(1)

      Name  Gender
488  Riley      12

### What is the median name occurrence?

### Որն է անունների հանդիպման մեդիանը՞

In [37]:
names.median()

Gender    3.0
dtype: float64

### Get a summary with the mean, min, max, std and quartiles.

### Ստացեք dataset-ի ամփոփում mean, min, max, std ու quartile-ներով

In [50]:
names.describe()

           Gender
count  575.000000
mean     4.353043
std      3.662916
min      1.000000
25%      1.000000
50%      3.000000
75%      8.000000
max     12.000000